[
  {
    "id": 1,
    "description": "Serve up this tasty Moroccan roast lamb dish for a low-calorie main that delivers stacks of flavour and three of your 5-a-day",
    "title": "Moroccan roast lamb with roasted roots & coriander",
    "ingredients": [
      "½ leg of lamb, around 800g",
      "2 red onions, cut into wedges",
      "1 butternut squash, skin left on, cut into wedges",
      "1 celeriac, peeled and cut into wedges",
      "2½ tbsp cold pressed rapeseed oil",
      "2 tbsp ras el hanout",
      "8 garlic cloves, skin on",
      "1 small bunch coriander",
      "½ tsp cumin seeds",
      "1 lemon, zested and juiced",
      "½ green chilli, deseeded"
    ],
    "method": [
      "Take the lamb out of the fridge while you chop the onions, squash and celeriac. Heat oven to 200C/180C fan/gas 6. Trim any excess fat off the leg of lamb, then cut a few slashes into the meat. Rub ½ tbsp oil and 1 tbsp ras el hanout over the lamb and season with salt and pepper. Put the onion, celeriac, butternut squash into a large roasting tin with the garlic. Toss with the remaining ras el hanout, remaining oil and some salt and pepper. Nestle the lamb into the tin and put in the oven to roast for 40 mins.",
      "Take the lamb out of the oven and leave to rest. Put the veg back in the oven for 20 mins. Meanwhile, blitz the coriander, cumin seeds, lemon zest, lemon juice and green chilli together in a mini food processor until finely chopped and vivid green.",
      "Carve the lamb, put on a platter, then pile on the veg. Sprinkle over some of the coriander mixture before taking the platter to the table for everyone to help themselves."
    ]
  },
  {
    "id": 2,
    "description": "Try a lighter take on roast lamb with this healthy Easter centrepiece. A trimmed leg of lamb is served with vibrant spring vegetables tossed in herbs and lemon",
    "title": "Healthy Easter lamb",
    "ingredients": [
      "2 onions, peeled and thickly sliced",
      "2 large carrots, thickly sliced",
      "boneless leg of lamb (around 1.5kg), trimmed of excess fat",
      "4 garlic cloves, sliced",
      "3 rosemary sprigs, leaves picked",
      "2 tbsp olive oil"
    ],
    "method": [
      "Heat the oven to 200C/180C fan/gas 6. Put the onions and sliced carrots in a large roasting tray. Remove any string from the lamb and put it on top of the veg, skin-side up. Pierce the lamb with the tip of a knife to make small pockets in the meat, add garlic slices and a few rosemary leaves to the holes. Rub the lamb with 1 tbsp olive oil and season. Pour 100ml water into the tray.",
      "Roast uncovered for 45 minutes at the top of the oven. Check the internal temperature, it should read 60C for medium (pink). Cook for another 15 minutes for well done. Rest the meat under foil for 10 mins while you cook the veg.",
      "Bring a large pan of salted water to the boil. Add the carrots, and cook for 8 minutes until tender, adding the peas and beans for the last 2 minutes. Drain the veg and toss with 1 tbsp oil, chopped herbs, lemon zest and juice. Season to taste.",
      "Carve the lamb into thin slices. Spread the veg onto a large warmed serving platter and arrange the meat in the middle."
    ]
  },
  {
    "id": 3,
    "description": "A healthy, all-in-one roast lunch, that supplies two portions of veg and a vitamin C boost",
    "title": "Lemon & garlic roast chicken with charred broccoli & sweet potato mash",
    "ingredients": [
      "1 small free-range chicken (about 1kg)",
      "2 garlic cloves",
      "1 tsp rapeseed oil",
      "small bunch thyme",
      "1 lemon, halved",
      "1 small head broccoli (about 200g), cut into small florets",
      "200g sweet potato, peeled and cubed (cook 100g extra if you are using for Chicken wrap with sticky sweet potato, see 'goes well with')",
      "1 tbsp low-fat cream cheese"
    ],
    "method": [
      "Heat oven to 200C/180C fan/gas 6 and put the chicken in a large non-stick roasting tin. Halve 1 garlic clove and rub it over the chicken. Drizzle with oil, rub in with your fingers, then stuff the cavity with the thyme, 1 lemon half and the garlic you just used.",
      "Cut the other lemon half into quarters and scatter around the chicken with the other garlic clove, halved.",
      "Cover the tin with foil and bake for 40 mins, then remove the foil and spoon over the hot juices. Arrange the broccoli around the chicken, turning well in the juices, and return the tin to the oven for another 20-30 mins. To check that it is cooked through, pierce between the leg and thigh – if the juices run clear, the chicken is ready. Re-cover with foil and set aside while you prepare the sweet potatoes.",
      "Put the sweet potatoes in a pan of boiling water, return to the boil, then simmer for 7-10 mins until tender. Drain well, then mash. Set aside 100g of sweet potato mash if using for Chicken wrap with sticky sweet potato, see 'goes well with', then add the cream cheese to the rest and stir well.",
      "Remove the broccoli from the roasting tin and divide between 2 plates. Put the chicken on a serving plate, discard the lemon and garlic from the tin and remove as much of the fat from the juices as possible. Pour the remaining juices into a serving jug.",
      "Carve the chicken and serve about 100g (1-2 slices) per person (keep the rest of the chicken for Chicken wrap with sticky sweet potato if making, see 'goes well with'). Serve with the broccoli and mashed sweet potatoes, and a drizzle of the lemony-garlic juices on top."
    ]
  },
  {
    "id": 4,
    "description": "Roast a turkey crown if you're catering to fewer people this Christmas. It's also a lighter option if you don't want to overindulge on the big day",
    "title": "Healthy roast turkey crown",
    "ingredients": [
      "2kg turkey crown on the bone",
      "3 oranges, 1 cut into wedges, ½ sliced, 1 ½ juiced",
      "1 tbsp runny honey, plus extra for drizzling",
      "handful thyme sprigs, leaves picked from one, two left whole, plus sprigs to serve (optional)",
      "1 tsp soy sauce",
      "2 bay leaves",
      "500g carrots, peeled and cut into long batons",
      "500g parsnips, peeled and cut into long batons"
    ],
    "method": [
      "Take your turkey crown out of the fridge 1-2 hrs before you want to cook it. Heat oven to 200C/180C fan/gas 6. Cut 4 slices from one of the oranges. Juice the rest of it along with another of the oranges. In a small bowl, stir the orange juice together with the honey and the picked thyme leaves, the soy sauce and a good grinding of black pepper.",
      "Loosen the skin over the turkey breast. Place two slices of orange, a bay leaf and thyme sprig under the skin, on both sides of the breast, then spoon in some of the juice mix and smooth the skin back over. Tip the orange wedges into a roomy roasting tin with the carrots and parsnips. Nestle the crown amongst the vegetables and oranges. Drizzle over about a third of the remaining orange juice mix and roast everything in the oven for 30 mins. Remove, give the veg a stir and drizzle over another third of the juice mix, then return to the oven and do that again one more time, roasting the turkey for a total of 1hr 30 mins (covering with foil halfway through if it begins to colour too much).",
      "Remove the turkey from the roasting tin and place on a board covered with foil, then turn the oven up to 220C/200C fan/gas 8. Toss the veg in a drizzle of honey and put the tin back in the oven to caramelise the veg for 25-30 mins, leaving the turkey crown to rest. Serve the crown on a platter surrounded by the glazed roots, orange wedges and extra thyme sprigs, if you like. Remove the sticky skin from the breast before carving the meat to serve as a side."
    ]
  },
  {
    "id": 5,
    "description": "This lean roast dinner uses pork leg topped with prosciutto. Serve with roast potatoes, carrots and celeriac, plus lots of herbs and an apple gravy",
    "title": "Herb roast pork with vegetable roasties & apple gravy",
    "ingredients": [
      "1 ¼kg boneless pork leg roasting joint",
      "1 tbsp wholegrain mustard",
      "2 tbsp chopped parsley",
      "2 tbsp chopped thyme, plus a few extra sprigs",
      " tsp chopped sage",
      "4 good sprays of oil",
      "3 carrots, halved lengthways, then cut across",
      "6 small potatoes (500g), halved",
      "2 red onions, cut into wedges",
      "12 garlic cloves",
      "1 small celeriac (650g), peeled and cut into 12 wedges"
    ],
    "method": [
      "Heat oven to 180C/160C fan/gas 4. Cut all the rind and fat off the pork and discard so that you are left with a lean chunk of meat. Spread with the mustard, scatter with the chopped herbs and season with black pepper. Place the prosciutto slices on top of the pork to protect the meat where the fat has been removed.",
      "Spray a large roasting tin with oil and put the pork in the centre. Surround with all the vegetables, scatter with the thyme sprigs, then spray again and cover with foil. Roast for 1 hr, then turn the heat up to 220C/200C fan/gas 7. Uncover, spray again and roast for 20 mins more.",
      "Meanwhile, make the gravy. Mix the cornflour with a little water to make a wet paste, heat the stock in a pan, stir in the cornflour mixture and cook, stirring, until thickened. Add the apple and cook for 5 mins until it’s softened but still holds its shape.",
      "Remove the meat from the tin and pour any juices from the tin into the gravy. Spray the veg with oil and roast for 20 mins more (while the meat rests) to brown them. Serve the pork with the roasted and fresh vegetables, and the apple gravy."
    ]
  }
]
